["…Image Processing Fundamentals \n \n  4 The number of distinct gray levels is usually a power of 2, that is, L=2B where B \nis the number of bits in the binary repr esentation of the brightness levels. When \nB>1 we speak of a gray-level image ; when B=1 we speak of a  binary image . In a \nbinary image there are just two gray leve ls which can be referred to, for example, \nas “black” and “white” or “0” and “1”.  \n2.2 CHARACTERISTICS OF IMAGE OPERATIONS  \nThere is a variety of ways to classi fy and characterize image operations. The \nreason for doing so is to understand what type of results we might expect to \nachieve with a given type of operation or  what might be the computational burden \nassociated with a given operation. \n2.2.1 Types of operations", "achieve with a given type of operation or  what might be the computational burden \nassociated with a given operation. \n2.2.1 Types of operations \nThe types of operations that can be applied to digital images to transform an input \nimage a[m,n] into an output image b[m,n] (or another representation) can be \nclassified into three categories as shown in Table 2.  \nOperation Characterization Generic \nComplexity/Pixel \n• Point  – the output value at a specific coordinate is dependent only \non the input value at that same coordinate. constant  \n• Local  – the output value at a specific coordinate is dependent on the \ninput values in the neighborhood  of that same coordinate. P2 \n• Global  – the output value at a specific coordinate is dependent on all \nthe values in the input image. N2", "input values in the neighborhood  of that same coordinate. P2 \n• Global  – the output value at a specific coordinate is dependent on all \nthe values in the input image. N2 \nTable 2:  Types of image operations. Image size = N × N; neighborhood size \n= P × P. Note that the complexity is specified in operations per pixel . \n \nThis is shown graphically in Figure 2.  \na b\nPointa b\nLocal\na b Global\n= [m=m o, n=n o]\n \nFigure 2:  Illustration of various types of image operations", "…Image Processing Fundamentals \n \n  5 2.2.2 Types of neighborhoods \nNeighborhood operations play a key role in modern digital image processing. It is \ntherefore important to understand how im ages can be sampled and how that \nrelates to the various neighborhoods that can be used to process an image.  • Rectangular sampling – In most cases, images are sampled by laying a rectangular grid over an image as illustrated in Figure 1. This results in the type of \nsampling shown in Figure 3ab.  • Hexagonal sampling – An alternative sa mpling scheme is shown in Figure 3c \nand is termed hexagonal sampling.  Both sampling schemes have been studied  extensively [1] and both represent a \npossible periodic tiling of the continuous  image space. We will restrict our", "and is termed hexagonal sampling.  Both sampling schemes have been studied  extensively [1] and both represent a \npossible periodic tiling of the continuous  image space. We will restrict our \nattention, however, to only rectangular sa mpling as it remains, due to hardware \nand software considerations, the method of choice.  Local operations produce an output pixel value b[m=m\no,n=no] based upon the \npixel values in the neighborhood  of a[m=mo,n=no]. Some of the most common \nneighborhoods are the 4-connected neighborhood and the 8-connected \nneighborhood in the case of rectangul ar sampling and the 6-connected \nneighborhood in the case of hexagonal sampling illustrated in Figure 3.  \n \n Figure 3a Figure 3b Figure 3c \n Rectangular sampling Rectangular sampling Hexagonal sampling", "neighborhood in the case of hexagonal sampling illustrated in Figure 3.  \n \n Figure 3a Figure 3b Figure 3c \n Rectangular sampling Rectangular sampling Hexagonal sampling \n 4-connected 8-connected 6-connected \n2.3 VIDEO PARAMETERS  \nWe do not propose to describe the processing of dynamically changing images in \nthis introduction. It is appropriate—given  that many static images are derived \nfrom video cameras and frame grabbers — to mention the standards that are \nassociated with the three standard video schemes that are currently in worldwide \nuse – NTSC, PAL, and SECAM. This information is summarized in Table 3."]